In [1]:
import pandas as pd

In [2]:
a = {'name':['Jane','Tom','Alice','John'],
     'age':[34,27,51,45],
     'point':[80,70,90,60]}
print(a)
df1 = pd.DataFrame(a,columns=['name','point','age','etc'],
                   index=['학생1','학생2','학생3','학생4'])

{'name': ['Jane', 'Tom', 'Alice', 'John'], 'age': [34, 27, 51, 45], 'point': [80, 70, 90, 60]}

In [3]:
df1.head()

      name  point  age  etc
학생1   Jane     80   34  NaN
학생2    Tom     70   27  NaN
학생3  Alice     90   51  NaN
학생4   John     60   45  NaN

In [4]:
print(df1['name'])

학생1     Jane
학생2      Tom
학생3    Alice
학생4     John
Name: name, dtype: object

In [5]:
print(df1.name)

학생1     Jane
학생2      Tom
학생3    Alice
학생4     John
Name: name, dtype: object

In [6]:
print(df1[['age','point']]) # 열 이름 호출  # Column의 slicing

     age  point
학생1   34     80
학생2   27     70
학생3   51     90
학생4   45     60

In [7]:
print(df1[1:3]) # 행 번호 호출 [숫자:숫자]  row의 slicing

      name  point  age  etc
학생2    Tom     70   27  NaN
학생3  Alice     90   51  NaN

In [9]:
print(df1[1:2][['age','point']])

     age  point
학생2   27     70

In [10]:
print(df1[1:2][['age']])

     age
학생2   27

In [11]:
print(df1[1:2]['age'])

학생2    27
Name: age, dtype: int64

In [12]:
print(df1.loc['학생2']) # 행 이름 추출

name     Tom
point     70
age       27
etc      NaN
Name: 학생2, dtype: object

In [13]:
print(df1.loc['학생2'][['age','point']]) # 행 이름, 열 이름 추출

age      27
point    70
Name: 학생2, dtype: object

In [14]:
print(df1.iloc[0]) # 행 번호 추출

name     Jane
point      80
age        34
etc       NaN
Name: 학생1, dtype: object

In [15]:
print(df1['학생2':'학생3'])

      name  point  age  etc
학생2    Tom     70   27  NaN
학생3  Alice     90   51  NaN

In [16]:
print(df1.loc['학생2':'학생3'])

      name  point  age  etc
학생2    Tom     70   27  NaN
학생3  Alice     90   51  NaN

In [17]:
print(df1.loc['학생2':'학생3', 'point':'age'])

     point  age
학생2     70   27
학생3     90   51

In [18]:
print(df1.loc[:, 'point':'age'])

     point  age
학생1     80   34
학생2     70   27
학생3     90   51
학생4     60   45

In [24]:
print(df1[0:2])
print('----------------')
print(df1.iloc[0:2])

     name  point  age  etc
학생1  Jane     80   34  NaN
학생2   Tom     70   27  NaN
----------------
     name  point  age  etc
학생1  Jane     80   34  NaN
학생2   Tom     70   27  NaN